Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_Hyperflash.cpp
	return FLEXSPI_TransferBlocking (base, &flashXfer);
}

/*! WaitBusBusy:
\brief Wait until the Write/erase operation is finished and the Flash is not busy anymore
\param base The Flex-SPI-base to use
\return status_t kStatus_Success if the operation was successfully */
status_t WaitBusBusy (FLEXSPI_Type *base)
{
	// Wait status ready.	
	uint32_t readValue{};
	status_t status{};
	flexspi_transfer_t flashXfer{};

	flashXfer.deviceAddress = 0;
	flashXfer.port      = kFLEXSPI_PortA1;
	flashXfer.cmdType   = kFLEXSPI_Read;
	flashXfer.SeqNumber = 2;
	flashXfer.seqIndex  = LUT_ReadStatus;
	flashXfer.data      = &readValue;
	flashXfer.dataSize  = 2;

	bool isBusy = false;
	do
	{
		status = FLEXSPI_TransferBlocking (base, &flashXfer);

		if (status != kStatus_Success)
			return status;

		if (readValue & 0x8000)
			isBusy = false;
		else
			isBusy = true;

		if (readValue & 0x3200)
		{
			status = kStatus_Fail;
			break;
		}
	}
	while (isBusy);

	return status;
}

/*! EraseChip:
\brief Erase the whole-Flash-memory
\param base The FlexSPI-Interface where the Flash is located which should be erased
\return static status_t Status of the Operation - kStatus_Success when successfully */
[[maybe_unused]] static status_t EraseChip (FLEXSPI_Type *base)
{
	DebugPrintf ("EraseChip\r\n");

	status_t status = WriteEnable (base, 0);
	if (status != kStatus_Success)
		return status;

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 4;
	flashXfer.seqIndex      = LUT_EraseChip;
	status = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	return WaitBusBusy (base);
}

/*! EraseSector:
\brief Erase a sector of the Flash-Memory
\param h Handle to the Flash-Driver
\param si Information about the sector which should be erased
\return static int LIBMEM_STATUS_SUCCESS when the erase operation was successfully, otherwise LIBMEM_STATUS_ERROR */
static status_t EraseSector (libmem_driver_handle_t *h, libmem_sector_info_t *si)
{
	if (IsSectorEmpty (reinterpret_cast<uint32_t *>(si->start), SectorSize))
		return LIBMEM_STATUS_SUCCESS;

	FLEXSPI_Type *base = (FLEXSPI_Type *)h->user_data;
	uint32_t SectorAddr = libmem_CalculateOffset (h, si->start);
	if (SectorAddr == UINT32_MAX)
		return LIBMEM_STATUS_INVALID_RANGE;

	DebugPrintf ("EraseSector at 0x%x, size: %d\r\n", SectorAddr, si->size);

	// Write enable
	status_t status = WriteEnable (base, SectorAddr);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = SectorAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 4;
	flashXfer.seqIndex      = LUT_EraseSector;
	status = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	status = WaitBusBusy (base);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	return LIBMEM_STATUS_SUCCESS;
}

/*! ProgramPage:
\brief Write Data to a Flash-Page
\param h Handle to the Flash-Driver
\param Dest Address to write the Data to. This Address is in the Address-Range of the Controller
\param Source Address of the Array with the Data to write
\return static int LIBMEM_STATUS_SUCCESS when the write operation was successfully, otherwise LIBMEM_STATUS_ERROR */
static int ProgramPage (libmem_driver_handle_t *h, uint8_t *Dest, const uint8_t *Source)
{
	FLEXSPI_Type *base = (FLEXSPI_Type *)h->user_data;
	uint32_t DeviceAddress = libmem_CalculateOffset (h, Dest);
	if (DeviceAddress == UINT32_MAX)
		return LIBMEM_STATUS_INVALID_RANGE;

	DebugPrintf ("ProgramPage at 0x%X\r\n", DeviceAddress);

	// Write enable
	status_t status = WriteEnable (base, DeviceAddress);
	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	// Prepare page program command
    flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = DeviceAddress;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Write;
	flashXfer.SeqNumber     = 2;
	flashXfer.seqIndex      = LUT_PageProgram;
	flashXfer.data          = (uint32_t *)Source;
	flashXfer.dataSize      = HYPERFLASH_PAGE_SIZE;
	status = FLEXSPI_TransferBlocking (base, &flashXfer);

	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	status = WaitBusBusy (base);

	// Program finished, speed the clock to 166M.
//	FLEXSPI_Enable     (base, false);
//	CLOCK_DisableClock (kCLOCK_FlexSpi);
//	CLOCK_SetDiv       (kCLOCK_FlexspiDiv, 0); // flexspi clock 332M, DDR mode, internal clock 166M.
//	CLOCK_EnableClock  (kCLOCK_FlexSpi);
//	FLEXSPI_Enable     (base, true);


	if (status != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	return LIBMEM_STATUS_SUCCESS;
}

/*! libmem_ProgramPage:
\brief The LIBMEM driver's write function.
\param h    A pointer to the handle of the LIBMEM driver.
\param dest A pointer to the memory address in memory range handled by driver to write data to.
\param src  pointer to the memory address to read data from.
\param size The number of bytes to write.
\return int The LIBMEM status result */
static int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
{
	DebugPrintf ("libmem_ProgramPage at 0x%x - size: %d\r\n", dest, size);
	LibmemDriver *driver = static_cast<LibmemDriver *>(h);
	return libmem_driver_paged_write (h, dest, src, size, &driver->PageWriteControlBlock);
}

/*! libmem_EraseSector:
\brief The LIBMEM driver's erase function
\param h           A pointer to the handle of the LIBMEM driver.
\param start       A pointer to the initial memory address in memory range handled by driver to erase.
\param size        The number of bytes to erase.
\param erase_start A pointer to a location in memory to store a pointer to the start of the memory range that has actually been erased or nullptr if not required.
\param erase_size  A pointer to a location in memory to store the size in bytes of the memory range that has actually been erased or nullptr if not required.
\return int        The LIBMEM status result */
static int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size)
{
	return libmem_foreach_sector_in_range (h, start, size, EraseSector, erase_start, erase_size);
}

/*! libmem_Flush:
\brief The LIBMEM driver's flush function.
\param h    A pointer to the handle of the LIBMEM driver. 
\return int The LIBMEM status result */
static int libmem_Flush (libmem_driver_handle_t *h)
{
	DebugPrint ("libmem_Flush\r\n");
	LibmemDriver *driver = static_cast<LibmemDriver *>(h);
	return libmem_driver_paged_write_flush (h, &driver->PageWriteControlBlock);
}

/*! libmem_Read:
\brief The LIBMEM driver's read extended function.
\param h    A pointer to the handle of the LIBMEM driver.
\param dest A pointer to the initial memory address to write data to.
\param src  A pointer to the initial memory address in the memory range handled by the driver to read data from.
\param size The number of bytes to write.
\return int The LIBMEM status result */
static int libmem_Read (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
{
	(void)h;
	if (size)
		memcpy (dest, src, size);
	return LIBMEM_STATUS_SUCCESS;
}

/*! libmem_CRC32:
\brief The LIBMEM driver's crc32 extended function.
\param h     A pointer to the handle of the LIBMEM driver.
\param start A pointer to the start of the address range.
\param size  The size of the address range in bytes.
\param crc   The initial CRC-32 value.
\return uint32_t The computed CRC-32 value. */
static uint32_t libmem_CRC32 (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc)
{
	(void)h;
	crc = libmem_crc32_direct (start, size, crc);
	return crc;
}

